[
	{
		"title": "Join the Defold and Yandex.Games Jam 2021!",
		"body": "The Defold Foundation and Yandex.Games is hereby inviting Defold developers across the world to join a month long game jam. Developers will be challenged to create a themed web game showing their creative and developer skills as well as a good integration with the Yandex.Games SDK. The proud winner and runner-ups will receive marketing and advertisment for their submitted game, hardware, swag and bragging rights!<br/><p style='text-decoration:underline;'>LEARN MORE</p>",
		"url": "/yandex-game-jam-2021/",
		"banner": "GREAT PRIZES!",
		"show": true
	},
	{
		"title": "Join the Web Monetization Challenge 2020!",
		"body": "The Defold Foundation is hereby cordially inviting you and your fellow web game developers across the world to join the month long Web Monetization game jam. Developers will be challenged to create a themed web game showing their creative and developer skills as well as a good use of Web Monetization in their games. The proud winner and runner-ups will receive cash prizes, swag and bragging rights!<br/><p style='text-decoration:underline;'>LEARN MORE</p>",
		"url": "/web-monetization-challenge-2020/",
		"banner": "CASH PRIZES!",
		"show": false
	},
	{
		"title": "Defold adds support for Nintendo Switch!",
		"body": "STOCKHOLM, SWEDEN - Jun 24, 2020 - We are happy to announce the immediate availability of Nintendo Switch support for the Defold game engine. Nintendo Switch is the first console supported by Defold. Approved Nintendo Switch developers can request access to Defold through the Nintendo Developer Portal. Access will be granted to Defold community members with Nintendo Switch included in their membership tier. Source code access is available as a separate membership tier.<br/><p style='text-decoration:underline;'>Learn more</p>",
		"url": "/2020/06/24/Defold-adds-support-for-Nintendo-Switch/",
		"topicon": "/images/logo/platform/switch-black-text.svg",
		"banner": "CONSOLE SUPPORT!",
		"show": false
	},
	{
		"title": "Defold has been transferred to the Defold Foundation and made all source code available",
		"body": "STOCKHOLM, SWEDEN - May 19, 2020 - We are happy to announce that Defold, the ultimate free to use cross platform game engine, is now sharing all source code with a developer-friendly license! This move will bring transparency to the development process and invite external contributors to make the engine better for everyone. As part of this move, King has decided to transfer Defold to a software foundation; the Defold Foundation. This will further strengthen Defold as a free engine and establish the future of Defold in the hands of the Defold Foundation together with the community and industry partners.<br/><p style='text-decoration:underline;'>Learn more</p>",
		"url": "/open",
		"show": false
	},
	{
		"title": "The Defold Foundation is awarded a grant from Grant for the Web",
		"body": "STOCKHOLM, SWEDEN - June 9, 2020 - We are happy to announce that we have been awarded a grant from Grant for the Web to explore the use of Web Monetization in games. We will use the grant to integrate, promote and support the use of Web Monetization in web games created using Defold. .<br/><p style='text-decoration:underline;'>Learn more</p>",
		"url": "/2020/06/09/Defold-is-awarded-a-grant-from-Grant-for-the-Web/",
		"show": false,
	}
]
