[
	{
		"q": "Q: Is Defold still owned by King?",
		"a": "A: No, Defold has been donated to the Defold Foundation. King holds a single seat on the Defold board but has no direct influence on Defold any longer."
	},
	{
		"q": "Q: Has King abandoned Defold?",
		"a": "A: No, King is still using Defold for some live games."
	},
	{
		"q": "Q: Who is working on Defold?",
		"a": "A: Defold is still being worked on by some of the the original development team. The team has plans to grow during 2020 but as with any open source project it will also to some extent rely on community contributions."
	},
	{
		"q": "Q: Who pays for Defold development?",
		"a": "A: King made a one-time monetary donation when the foundation was created. This money was earmarked for Defold development and operation and while the donation was generous it will not last forever. Defold will fund continued development through donations and partnership deals."
	},
	{
		"q": "Q: Will the quality of Defold degrade now that it is open source and accepting community contributions of varying quality?",
		"a": "A: No. We will never compromise on code quality. We will only accept contributions that have been officially reviewed by the team, and we will impose the same high standards on community contributions as contributions made by the core team. We will also not accept contributions that aren't in line with our roadmap."
	},
	{
		"q": "Q: Will we still have a stable engine that is kept up to date with the latest platform requirements for iOS, Android and more?",
		"a": "A: Yes. The core team will always focus on maintaining a stable and up to date engine, but we may from time to time ask for help from the community. The main responsibility is however always on the core team."
	},
	{
		"q": "Q: Will the native extension build servers be shut down?",
		"a": "A: No. We believe the native extension build servers to be such an integral part of the Defold product offering that they should remain available as a free service to our users. And now that the build server is open source anyone is free to set up and run their own server, either locally or as a public or private server."
	},
	{
		"q": "Q: Is there still going to be a roadmap for Defold?",
		"a": "A: Yes, the code development team will maintain a <a href='https://github.com/defold/defold/projects/27' target='_blank'>public roadmap on GitHub</a>"
	},
	{
		"q": "Q: What parts of the Defold product is open source?",
		"a": "A: All of it. The engine and editor are open sourced from <a href='https://www.github.com/defold/defold' target='_blank'>this GitHub repository</a>. The native extension build server is open sourced from <a href='https://www.github.com/defold/extender' target='_blank'>this GitHub repository</a>. Extensions and other miscellaneous projects are also open sourced [on GitHub](https://www.github.com/defold)."
	},
	{
		"q": "Q: This is great! How do I start contributing?",
		"a": "A: antastic! Head over to the main Defold repository and read up on <a href='https://github.com/defold/defold/blob/dev/CONTRIBUTING.md' target='_blank'>how to contribute</a>."
	}
]
