[
	{
		"q": "Q: Is Defold still owned by King?",
		"a": "A: No, Defold has been donated to the Defold Foundation. King holds a single seat on the Defold board but has no direct influence on Defold any longer."
	},
	{
		"q": "Q: Has King abandoned Defold?",
		"a": "A: No, King is still using Defold for some live games."
	},
	{
		"q": "Q: Who is working on Defold?",
		"a": "A: Defold is still being worked on by some of the the original development team. The team has plans to grow during 2020 but as with any open source project it will also to some extent rely on community contributions."
	},
	{
		"q": "Q: Who pays for Defold development?",
		"a": "A: King made a one-time donation when the foundation was created. This money is earmarked for Defold development and operations and while the donation was generous it will not last forever. Defold will fund continued development through donations and partnership deals."
	},
	{
		"q": "Q: Will the quality of Defold degrade now that it is open source and accepting community contributions?",
		"a": "A: No. We will never compromise on code quality. We will only accept contributions that have been reviewed by the team, and we will impose the same high standards on community contributions as contributions made by the core team. We will also not accept contributions that aren't in line with our roadmap."
	},
	{
		"q": "Q: Will we still have a stable engine that is kept up to date with the latest platform requirements for iOS, Android and more?",
		"a": "A: Yes. The core team will always focus on maintaining a stable and up to date engine, but we may from time to time ask for help from the community. The main responsibility of keeping the engine and editor updated is however on the core team."
	},
	{
		"q": "Q: Will the native extension build servers be shut down?",
		"a": "A: No. We believe the native extension build servers to be such an integral part of the Defold product offering that they should remain available as a free service to our users. And now that the build server is open source anyone is free to set up and run their own server, either locally or as a public or private server."
	},
	{
		"q": "Q: Is there still going to be a roadmap for Defold?",
		"a": "A: Yes, the code development team will maintain a <a href='https://github.com/defold/defold/projects/27' target='_blank'>public roadmap on GitHub</a>"
	},
	{
		"q": "Q: What parts of the Defold product is open source?",
		"a": "A: All of it. The engine and editor are open sourced from <a href='https://www.github.com/defold/defold' target='_blank'>this GitHub repository</a>. The native extension build server is open sourced from <a href='https://www.github.com/defold/extender' target='_blank'>this GitHub repository</a>. Extensions and other miscellaneous projects are also open sourced <a href='https://www.github.com/defold' target='_blank'>on GitHub</a>."
	},
	{
		"q": "Q: This is great! I want to contribute! Where do I start?",
		"a": "A: Fantastic! Head over to the main Defold repository and read up on <a href='https://github.com/defold/defold/blob/dev/CONTRIBUTING.md' target='_blank'>how to contribute</a>."
	},
	{
		"q": "Q: I would like to contribute but I don't know C/C++ or Clojure so I can't help with the engine and editor. Can I help out some other way?",
		"a": "A: You don't need to know C/C++ or Clojure to help out. We would be thrilled to accept contributions to our documentation, examples and tutorials. Learn more about <a href='https://github.com/defold/defold/blob/dev/CONTRIBUTING.md' target='_blank'>how to contribute</a>. {% include patreon.html %}"
	},
	{
		"q": "Q: Does that mean you will rely on the community for most of the new features?",
		"a": "A: No. There will still be a team of developers working on the engine, but the team will initially be smaller. We believe that some members from our community would be interested in contributing."
	},
	{
		"q": "Q: I do not have the time to contribute new code to the engine but I would be more than happy to contribute financially. Can I do this?",
		"a": "A: Yes, absolutely. We accept monthly donations via Patreon and one time donations via PayPal."
	},
	{
		"q": "Q: The Defold community is quite small. Are you sure there is enough people that can and are willing to contribute? And what will you do to increase the number of users?",
		"a": "A: It is true that the Defold community isn't huge and it has up until now never been a goal to attract a huge number of game developers. Despite this the Defold community has grown year over year, a fact which we are very proud of. We do believe that the move to open source Defold will attract new developers and we hope that some of those developers would also be interested in contributing."
	}
]
